In [1]:
import numpy as np
import pandas as pd

In [25]:
#데이터프레임에서 NaN 여부 확인 (True로)
df1=pd.DataFrame({'C1':[1,2,np.nan],'C2':[10,np.nan,30],'C3':[100,200,300]},index=['i1','i2','i3'])
df1

     C1    C2   C3
i1  1.0  10.0  100
i2  2.0   NaN  200
i3  NaN  30.0  300

In [26]:
pd.isnull(df1)

       C1     C2     C3
i1  False  False  False
i2  False   True  False
i3   True  False  False

In [27]:
df1.isnull()

       C1     C2     C3
i1  False  False  False
i2  False   True  False
i3   True  False  False

In [28]:
#결측치 포함 행 또는 열 제거하기 - 결측치가 포함된 행을 제거할 때는 dropna 메소드를 사용
#행제거
df1.dropna()

     C1    C2   C3
i1  1.0  10.0  100

In [29]:
# 결측치가 포함된 열을 제거
df1.dropna(axis=1)

     C3
i1  100
i2  200
i3  300

In [30]:
#결측치를 원하는 값으로 채우기 - fillna 메소드를 사용
df1.fillna(0)

     C1    C2   C3
i1  1.0  10.0  100
i2  2.0   0.0  200
i3  0.0  30.0  300

In [31]:
df1

     C1    C2   C3
i1  1.0  10.0  100
i2  2.0   NaN  200
i3  NaN  30.0  300

In [32]:
# 결측치를 각 열의 평균값으로 채우기
df1.fillna(df1.mean())

     C1    C2   C3
i1  1.0  10.0  100
i2  2.0  20.0  200
i3  1.5  30.0  300

In [33]:
#특정 값을 na 로 바꾸기 - replace 메소드를 사용
df2=pd.DataFrame({'A':[1,2,3],'B':[10,3,30],'C':[100,200,300]},index=['i1','i2','i3'])

In [34]:
df2

    A   B    C
i1  1  10  100
i2  2   3  200
i3  3  30  300

In [35]:
df2.replace(3,np.nan)

      A     B    C
i1  1.0  10.0  100
i2  2.0   NaN  200
i3  NaN  30.0  300

In [36]:
#딕셔너리를 사용 한번에 여러개의 값을 변경
df2.replace({100:'A', 200:'B', 300:'C'}, inplace=True)
df2

    A   B  C
i1  1  10  A
i2  2   3  B
i3  3  30  C